/**
 * КАТЕГОРИИ ДОХОДОВ И РАСХОДОВ
 */

const CATEGORIES = {
    income: [
        { name: 'Основной доход', subs: [] },
        { name: 'Аванс', subs: [] },
        { name: 'Премия', subs: [] },
        { name: 'Отпускные', subs: [] },
        { name: 'Подработка', subs: [] },
        { name: 'Подарок', subs: [] },
        { name: 'Сотрудник', subs: [] }
    ],
    
    expense: [
        { 
            name: 'Регулярные платежи', 
            subs: ['Кредит', 'Квартира', 'Связь', 'Подписки']
        },
        { 
            name: 'Продукты', 
            subs: ['Магазины', 'Кафе/рестораны']
        },
        { 
            name: 'Курение', 
            subs: ['Кальян', 'Дудка']
        },
        { 
            name: 'Транспорт', 
            subs: ['Парковки', 'Бензин', 'Ремонт машины', 'Такси', 'Мойка']
        },
        { 
            name: 'Здоровье и красота', 
            subs: ['Стрижка', 'Аптеки', 'Другое']
        },
        { 
            name: 'Личные покупки', 
            subs: ['Одежда', 'Для дома']
        },
        { name: 'Развлечения', subs: [] },
        { name: 'Подарки', subs: [] },
        { 
            name: 'Непредвиденные траты', 
            subs: ['Донат', 'Опоздание на работу', 'На мероприятие', 'Штрафы', 'Другое']
        },
        { name: 'Отпуск', subs: [] }
    ]
};
